["The original name of Flipline Studios company was Flipline Design.",
"Maggie was originally supposed to unlock Focaccia in Papa’s Pastaria.",
"The original name of Papa’s Taco Mia! was Papa’s Taqueria!",
"Cecilia is the only female to favor OnionFest in Papa’s Cucpakeria.",
"Mary is absent in Papa’s Freezeria due to her fear of sailing.",
"Papa’s Freezeria was nominated for the Best Game of 2011 and finished in second place!",
"Papa’s Freezeria is the last game to be sponsored by another website to prevent hackers from getting auths of the game.",
"Sarge and his minions come from the Land of Munchmore.",
"Big Pauly demanded four cupcakes in Papa’s Cupcakeria, but Matt and Tony decided two would be plenty.",
"Pinch Hitwell’s old self is hidden in the Customers tab of Papa’s Pizzeria under the name \"Johnny\"",
"Wally’s cart is named The SilverScale (and the smell of fish is still raised up from it :wink:)",
"Papa Louie’s original name was going to be Papa Lucci but was changed because it would have been confusing to pronounce.",
"The original name of Papa Louie: When Pizza’s Attack was intended to be  \"Pizza Panic\", but was changed due to the fact the name was already taken.",
"Gremmie favors the biggest amount of holidays, with 13 different holidays.",
"Flipline once planned a game involving coffee titled \"Papa’s Coffee Shop\". However, the idea was scrapped in favor of Papa’s Taco Mia!.",
"C.J. Friskins is the only male to favor Lunar New Year in Papa’s Pastaria To Go!",
"The Runner-Ups of Papa’s Next Chefs 2014, Matt & Clover, ended up being the winners of Papa’s Next Chefs 2016.",
"Evelyn was teased by a leopard-print decorated Easter egg that was included in the Easter 2020 holiday picture, 10 days before her actual appearance in-game.",
"Wendy was captured by Sarge and Radley Madish during the events of Papa Louie 2: When Burgers Attack!, as stated in a blog post for OnionFest 2019. However, she wasn’t a playable character because Sarge sent her back to Maple Mountain after Wendy built his tank.",
"Cameo was named after a variety of apples.",
"Before starting their career as video-games developers, Matt & Tony developed a cartoon series called the Freezing Pointe.",
"Hugo’s stage name is DJ Honey Buster.",
"Radlynn’s Style B is based off the disguise Radley used in the intro of Papa Louie 2: When Burgers Attack!",
"LePete is the first Closer to debut in an app game.",
"Papa’s Pizzeria HD is the first game in which neither Xandra or Xolo are Closers.",
"If a coupon is being delivered to Vincent, Akari will hand out the coupon to him.",
"Olga was once crowned as Miss Tastyville in the annual beauty pageant.",
"The chickens from Cactus McCoy and the Curse of Thorns can be seen outside of Papa’s Donuteria during Maple Mornings.",
"Mousse and Whippa are based off the style of spy movies from the 70s.",
"Koilee, Willow, and Rudy are the only characters to appear in a game first as a customer, then win a Papa’s Next Chefs tournament to become a worker for the next game.",
"Willow and Mary are the only customers to own pets and not bring them into any Gameria.",
"Tohru’s Halloween costume is a based off Super Mario Bros.",
"Julep’s great grandfather, Cornelius Powder, used to own the land which is known nowadays as Powder Point.",
"The container used for Sourballs differs in all versions of Papa’s Cupcakeria.",
"Steven is the only male to favor Holi in all versions of Papa’s Scooperia.",
"Coco Coolada Ice Cream was made up by Matt & Tony, which is an improved version of a chocolate pineapple swirl.",
"Papa’s Freezeria HD is the first app game to feature Custom Workers.",
"Kayla’s first role as an actress was in a Lemon Mist commercial.",
"During Valentine’s Day, Scarlett carries the wing bow from Jacksmith.",
"Zoe’s daydreams were to open a coffee shop.",
"During Halloween in Whiskview Mall, the mannequins from Fashion Flambé can be seen at the end of the day outside the store in random places.",
"Clover hates gym class.",
"Boomer was based off old designs of the Rocket Onion.",
"Papa Louie: When Pizzas Attack!, Papa’s Pizzeria, and Steak and Jake are the only games to have an animated intro instead of a slideshow.",
"During St. Paddy’s Day, the water in Portallini becomes green in color, just like the city of Chicago during the holiday.",
"Steak makes an appearance on the milk icon.",
"After a short vacation in Calypso Island, Rico’s pickiness loosed down. This is why he hasn’t been a Closer after Papa’s Taco Mia!",
"The hour and minute hand at Frostfield’s town clock match the user’s computer time, making the first Gameria to have its own built-in time.",
"Rowdy Rico: When Chilis Attack! is available as an arcade box that could be put in the Gamerias’ lobbies.",
"The burger Radley Madish orders in Papa Louie 2: When Burgers Attack!’s intro is the same as James’ order in Papa’s Burgeria.",
"Carlo Romano taught Marty his first guitar chords.",
"Marty’s guitar is also known as a Burguitar.",
"Shannon’s Style B misses her camera in Papa Louie Pals. This is because her camera is available as a prop.",
"Mayor Mallow makes a point each week to check the food quality of all the restaurants located in Frostfield.",
"Emmlette replaces Ninjoy’s position as a Closer in Papa’s Pancakeria HD/To Go!",
"The Skystone was the asteroid that destroyed the Kingdom of X.",
"In Papa’s Sushiria, the order in which you put the fillings in doesn’t matter, just as long as they’re evenly spaced.",
"Hope is the only customer in Papa’s Pastaria To Go! to favor Halloween and not dress up.",
"Ninjoy is the only Papa’s Freezeria debutant not to appear in Papa Louie 3: When Sundaes Attack!",
"Because Roy and Joy wear their uniform as their casual outfit, their Style B is available at Papa’s Pizzeria HD from the start.",
"Ember is a Scoutmaster for the Cookie Scout Troop 312.",
"Rita’s spatula is known as Flipper 5000.",
"Doan designs the posters that you’re able to buy at the shop.",
"Koilee owns a houseboat at the Showa Pond.",
"Allan moved away for a few years in Oniontown, which is why he is absent in Papa’s Burgeria.",
"Mr. Sherbet is the oldest Scoopian in Neapolitown.",
"Fernanda got her first job designing custom cabinetry for Groundchuck Homes.",
"Bow Shrooms are being fed from Leafy Larks.",
"King Percival Plumpfeather came to the throne at age 19 following his father.",
"Yum N’ M’s are reproduced from a flower called the Bloom n’ M. Soon",
"Shannon was one of the customers to attend Free Burger Day.",
"Doan is a buddy of Matt & Tony that went to college with with, and his Flipdeck has many similarities to his real professions.",
"Mandi is Tony’s wife in real life, and she actually owns the outfit she wears in-game.",
"Cactus McCoy and the Curse of Thorns took over 3 months to develop.",
"Pauly’s Pepper, a store owned by Big Pauly that specializes in peppers, is located right next to Papa’s Pizzeria.",
"Rita doesn’t have time to stop home and change, she heads straight to the Wingeria for dinner!",
"Many other animals, such as mice, ducks, and horses, were planned to appear in Jacksmith, but the weapons in Jacksmith’s smithy seemed to fit the animals in the final game better.",
"Customers can be seen on their electronic devices while waiting in lobby.",
"If Tony was to visit Papa’s Freezeria in real life, he would’ve ordered Sue’s order.",
"Sarge is the mascot of the Oniontown Crushers.",
"Papa’s Pizzeria’s original name was \"Delivery Boy Roy’s Pizza Panic\".",
"During college, Matt had a part-time job at a pizza shop and had first-hand knowledge of the process of making pizzas which was later developed into Papa’s Pizzeria.",
"The Romano Family Quartet was the imaginary creators of the Papa Louie: When Pizzas Attack! music tracks.",
"Papa’s Pizzeria originally had a feature called the Onion Alarm. When the Onion Alarm went off, The Onion Ring would’ve started a commotion with the customers in the lobby.",
"Bruna Romano was meant to be a completely different customer!",
"The information in the Customers tab was originally meant to include other info about the customers, such as their age and the last day where they came to the restaurant.",
"Giordana Romano was 8 years older than her husband, Little Edoardo.",
"Tony used to work as a busboy on TGIFs.",
"Pinch Hitwell plays for whoever is the current home team in Griller Stadium.",
"Hot Chocolate was meant to be in Papa’s Pancakeria, but Matt & Tony couldn’t find a solid way to put it into the station itself.",
"An idea for a chicken wings game was up in Matt & Tony’s minds since the days of Papa’s Wingeria.",
"In Papa’s Pizzeria, you can level up by earning tips.",
"Matt & Tony record each instrument of a music track by itself, which is why the Papa Louie: When Pizzas Attack! music is exported as single instruments.",
"The music for the Order Station is always the bass of the theme music.",
"Prune Creek Retirement Home is a senior-citizen residential building, in which Florentina Romano lives and enjoys from the lunch meals that are being served in there.",
"There is only one Cheese Wheel in Papa Louie 2: When Burgers Attack! as a reference to the lonely Cheese Wheel from Papa Louie: When Pizzas Attack!.",
"Papa Louie: When Pizzas Attack! was meant to include other baddies, such as jumping green peppers and flying cannolis. Placeholders for these baddies can be accessed in the game files.",
"The Flavor X Drizzle was found by Papa Louie, who found a batch of it in the uncharted X-Zone.",
"The Gondola 500 is held on the last Saturday of September in Portallini. ",
"Pirate Bash is September 19th, the same day as the International Talk Like a Pirate Day. ",
"Onionfest is a week long celebration in the town of Frostfield and usually takes place the second week of May.",
"Xandra is pickier about her sundaes than Xolo is!",
"When a customer is in a Gold Star Customer and their meter is filled up, you will start receiving extra tips from them.",
"When Santa first visits your restaurant, he already has a Silver Customer Award!",
"Lettuce Larks are being fed of Gummy Worms.",
"Papa’s Mocharia To Go reached the top 10 for iOS Paid Games 48 hours after its release!",
"The Jukebox, Boombox, and Phonograph can be turned off by tapping on them.",
"Hope is the oldest customer to appear in a Gameria and not have a Flipdeck.",
"Chuck, Nevada, Boomer, Willow, Sienna & Santa are the only customers to favor the same holiday since Cupcakeria",
"Utah favors Easter in Papa’s Donuteria to order Pink Lemonade Drizzle.",
"All customers who favor Big Top Carnival in Papa’s Donuteria favor Sugarplex Film Fest in Papa’s Donuteria To Go!",
"Papa’s Pastaria is the only Gameria to not feature Papa Louie in its intro.",
"Papa’s Mocharia To Go! is the first Gameria where Cletus does not favor a spring holiday.",
"Big Pauly wears a toupeé.",
"When a coupon is being sent to Vincent in Papa’s Mocharia To Go!, Rhonda delivers the coupon to him.",
"Pizza boxes appear in 3 Flipdecks - Wally’s, Roy’s, and Kenji’s.",
"Mesa’s outfit is based off other customers’ clothes, such as Cooper’s shoes, Koilee’s bracelets, Skyler’s hat, Timm’s necklace, and more.",
"Sarge Fan’s name includes an exclamation mark in Papa’s Pizzeria.",
"Starlight BBQ is celebrated with the barbecues that people do during the Starlight Jubilee season.",
"Although rescuing him in Papa Louie 2: When Burgers Attack! requires the Double Jump skill, Kingsley can also be rescued using the Gliding skill.",
"During the parade of Papa’s Pancakeria, the Gold Star Customers walk together in a big group.",
"All Special Recipes in Papa’s Mocharia To Go! are used with Large Cups.",
"A coupon can be sent to Santa outside of Christmas.",
"Radlynn and Trishna were originally intended to be vegan customers.",
"Xandra, Maggie and Allan are the only customers who unlock 2 different holidays.",
"Before unlocking Cletus, he can be seen wearing his Easter costume if he is seen outside of Papa’s Cheeseria.",
"Mitch enjoys all outdoors activies, such as camping, hiking, kayaking, and fishing with his grandfather, Wally.",
"Marty’s kart is the fastest kart in Papa’s Raceway.",
"Nevada’s first appareance was in Papa’s Freezeria’s Intro.",
"In Hallway Hunt, all customers’ eyes are in the same height.",
"The JellyRoll 20X6 isn’t used in Powder Point during the winter.",
"When getting Gold Star Customers in all customers, the select button turns golden.",
"Almond Snap Powder is made of almond cookies which are decorated with red and blue sprinkles for Starlight Jubilee.",
"Papa’s Freezeria, Papa’s Freezeria HD, and Papa’s Freezeria To Go! all give extra tip of $0.50 for getting the Build Station things land on the meter’s arrow.",
"Georgito is loosely based off of Tony’s friend. George was persistent about Tony making him a wealthy customer.",
"Johnny is loosely based off of Tony’s friend. John was the playtester of Matt and Tony’s games as soon as they were released.",
"Papa’s Hot Doggeria HD is the only savory app to not celebrate Maple Mornings.",
"In Papa Louie Pals, Pinch Hitwell owns the highest number of outfits, with 16 outfits.",
"Summer Luau, Thanksgiving, and Christmas are the only holidays to not be replaced by another holiday since the introduction of Holidays.",
"Papa’s Pastaria is the first Gameria to introduce outros.",
"November is the only month whose holiday icon has never changed, with Thanksgiving’s T icon remaining since Papa’s Cupcakeria.",
"Papa’s Pizzeria HD is the last Gameria to feature Christmas’s holiday icon as C.",
"Prudence is the only chef to write down customers’ orders with a different colored pencil.",
"If the customer you’re giving a Style B to is in the restaurant, then your chef will give them their Style B.",
"Papa’s Cheeseria To Go! is the only Gameria in which Pinch Hitwell’s Style B is not his casual outfit.",
"Papa’s Cupcakeria was the first Gameria where the service quality percentage would always round down.",
"Joy’s alter-ego was teased in her Flipdeck with the Purple Burple cup from Ninjoy’s Flipdeck.",
"Customers who dance next to a Jukebox, Boombox, or a Phonograph while holding something only perform one set of dance moves as opposed to the usual three sets.",
"Despite holding Bill, Boopsy can still hold objects with his left hand.",
"August and December are the only months in which a holiday line-up began.",
"Wingeria, Hot Doggeria, Pastaria & Cheeseria’s holiday line-ups all begin in May.",
"On the second day in Papa’s Scooperia, Papa’s Scooperia HD, and Papa’s Scooperia To Go!, all three customers must be served in order for the Closer to come.",
"Papa’s Sushiria has the highest amount of ingredients with 145 ingredients.",
"The hole in Xandra’s was removed starting with Papa’s Cupcakeria.",
"Yui is the only Kingsley’s Customerpalooza winner who doesn’t wear a jacket.",
"A, I, K, R, U & Z are the only letters that have never been used for holiday icons before. Z, however, is used as the Pizzeria icon in Papa’s Wingeria HD & Papa Louie Pals.",
"Papa Louie’s nationality is revealed to be Italian according to his Flipdeck.",
"Papa’s Donuteria To Go! is the only Gameria to feature Holidays and not have balloons as a furniture.",
"According to his creator, Nye is homosexual.",
"Akari, Cooper, James, Joy, Marty, Prudence, Rhonda, Rico, Roy, Rudy, Scarlett, and Willow are all known to be owning a drivers license.",
"Oniontown is heavily inspired by the real-life city of New York.",
"Frostfield celebrates most holidays out of any city in the Flipverse, with 18 holidays.",
"Utah favors Valentine’s Day in Cheeseria in favor of Sundried Tomatoes & Beetbread.",
"In Papa’s Pizzeria, the last customer of the day will always want their pizza cooked for the lowest cooking time.",
"Granny Smith special rewards the highest precentage of points, with 250% points.",
"In Papa’s Bakeria To Go!’s parade, the cars in front of Whiskview Mall are randomly sorted.",
"When delivering an order to Moe, it shows that he lives in a house. However, his Flipdeck states that he lives in an apartment.",
"Rank 100 is always reached at the seventh holiday.",
"Only male customers favor OnionFest in Papa’s Wingeria To Go!",
"In Hallway Hunt, short customers’ eyes are on the same height as everyone else’s.",
"Closers’ names have red outlines in the PC games.",
"Papa’s Hot Doggeria To Go! is the last Gameria to feature New Year’s holiday icon purple-colored.",
"Papa’s Pancakeria To Go! was the first To Go! game that didn’t include Easter in the holiday line-up.",
"The snakes on Olivia’s Halloween costume are the gummy worms from Slider Scouts.",
"Papa Louie and Penny are the only two customers to appear as playable chacarters in every game.",
"Sugarplex Film Fest is the first holiday to not appear in a PC game.",
"All Cinco de Mayo ingredients in Papa’s Scooperia To Go! begin with the letter C.",
"Cooper appears in Papa’s Freezeria’s intro despite being absent from the game.",
"All of Special Recipes in Papa’s Cheeseria and Papa’s Cheeseria To Go! are regular-cooked.",
"Santa only orders through the Delivery Phone if a coupon is sent to him."]